# 풀지 못한 문제
"""
문제
정수 N이 입력되면 00시 00분 00초부터 N시 59분 59초까지의 모든 시각 중에서 3이 하나라도 포함되는
모든 경우의 수를 구하는 프로그램을 작성하라. 예를 들어 1을 입력했을 때
다음은 3이 하나라도 포함되어 있으므로 세어야 하는 시각이다

00시 00분 03초
00시 13분 30초
반면에 다음은 3이 하나도 포함되어 있지 않으므로 세면 안 되는 시각이다

00시 02분 55초
01시 27분 45초
입력
첫째 줄에 정수 N이 입력된다.(0<=N<=23)

출력
00시 00분 00초부터 N시 59분 59초까지의 모든 시각 중에서 3이 하나라도 포함되는 모든 경우의 수를 출력한다.

입력 예시
5

출력 예시
11475
"""

import sys
n = int(sys.stdin.readline())

result = 0
# 시 -  3인경우 59*59
# 분 - 3 13 23 30-39 43 53 - 59씩
# 초 - 3 13 23 30-39 43 53 - 59씩
for i in range(n+1):
    for j in range(60):
        for k in range(60):
            if '3' in str(i)+str(j)+str(k):
                result += 1

print(result)
